test_headers = {
    1: [
        "T/r", "Hudud", "Davrlar", "Jami", "Telefon orqali",
        "Bot orqali", "Takroriy",
        "Zo‘ravonlik bo‘yicha qayd etilgan xabarlar", "Oila turmush doirasida",
        "Boshqa masalalarda", "Huquqiy tushuntirish berildi", "”102” ga yo‘naltirildi", "Hal etilishi lozim",
        "Hal etilgan", "Shundan", "Qoldiqda"
    ],
    2: [
        "Т/р", "Худуд кесимида", "Мунтазам норози кайфиятда бўлган шахслар сони", "Норозилик сабаблари",
        "\"Ашаддий\" норози кайфиядагилар сони",
        "Олди олинган норозилик намойишлар сони", "Ўтказилган норозилик чиқишлар сони",
        "Норозилик турлари", "Норозилик жойлари",

        "Норозилик чиқишлар сони", "Такрорий чиқишлар",
        "Норозиликда иштирок этган фуқаролар сони",
        "Шундан", "Қилинган мурожатлар юзасидан киритилган тақдимномалар сони",
        "Норозиликни ташкиллаштирган ва иштирок этган шахсларга нисбатан кўрилган чоралар сони",
        "ҲМҚО фаолиятидан", "Суд органидан", "Ҳокимият фаолиятидан", "Бошқа муаммо",
        "Норозилик сони", "Такрорий норозилик сони", "Иштирокчилар сони"
    ],
    3: [
        "П/н", "Регион", "Период", "Итого", "По телефону", "Телеграм-бот",
        "Повторное", "Зарегистрированные жалобы на насилие", "В рамках семейной жизни",
        "Другие вопросы", "Дано устное объяснения", "Отправлено в ”102”", "Подлежит решению", "Решено", "Из них",
        "В исполнении"
    ]
}




headers = [

        'Т.Р.','ҲУДУДЛАР','Давр','Жами қабул қилинганлар сони','шун-дан','қиз болалар','Қабул қилинганларни сақлаш муддатлари','Олиб келинган жойлари',
        'Ёши','Олиб келинганлардан','Оилавий ахволи','Профилактик ҳисобда турганлар','Кайта жойлаш-тирилганлар','Олиб келиш сабаблари','Бошка давлатларда яшовчи фуқаролар фарзандлари',
        'Бошка давлатлардан олиб келинган қаровсиз қолган вояга етмаганлар','Юборилган хабарлар бўйича','Олиб келинганлар кимларга топширилган',

        # 'қиз болалар', '48 соатгача', '10 кунгача', '20 кунгача', '30 кунгачаа', '45 кунгача', 'бозор', 'кўча', 'ер-тўла чор-доқ', 'бошқа жой', 'бошқа давлатлардан',
        # '3 ёшдан 6 ёшгача', '7 ёшдан 13 ёшгача', '14 ёшдан 18 ёшгача', 'ёши номаълум', 'Мактабгача таълим', 'Мактаб', 'Касб-хунар мактаб ', 'Касб-хунар колеж ', 'Лицей', 'Техникум', 'Махсус таълим',
        # 'ОТМ', 'Ўқимайди-ишламайди', 'Ишлайди', 'ота-онаси борлар', 'ота ёки онаси йўқлар', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР',
        # 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР', 'ҲУДУДЛАР',
    ]

subheaders = {
    'Қабул қилинганларни сақлаш муддатлари':['48 соатгача', '10 кунгача', '20 кунгача', '30 кунгачаа', '45 кунгача'],
    'Олиб келинган жойлари':['бозор', 'кўча', 'ер-тўла чор-доқ', 'бошқа жой', 'бошқа давлатлардан'],
    'Ёши':['3 ёшдан 6 ёшгача', '7 ёшдан 13 ёшгача', '14 ёшдан 18 ёшгача', 'ёши номаълум'],
    'Олиб келинганлардан':['Мактабгача таълим', 'Мактаб', 'Касб-хунар мактаб ', 'Касб-хунар колеж ', 'Лицей', 'Техникум', 'Махсус таълим','ОТМ', 'Ўқимайди-ишламайди', 'Ишлайди'],
    'Оилавий ахволи':['ота-онаси борлар', 'ота ёки онаси йўқлар','Васий қарамоғида','ҳеч кими йўқлар'],
    'Кайта жойлаш-тирилганлар':['иккинчи маротаба','учинчи маротаба'],
    'Олиб келиш сабаблари':['Назоратсиз қолган','Қаровсиз қолган','Давлат ва жамоатчилик  ёрдамига мухтож бўлган','Ижтимоий жихатдан хавфли аҳволдаги оилаларда яшаётган','Тарбияси оғир бўлган бола','Бедарак йўқолган ва қидирувда бўлган бола'],
    'Бошка давлатларда яшовчи фуқаролар фарзандлари':['Россия','Қозоғистон ','Қирғизистон','Тожикситон','Турманситон','Бошқа давлатлар'],
    'Бошка давлатлардан олиб келинган қаровсиз қолган вояга етмаганлар':['Россия','Қозоғистон ','Қирғизистон','Тожикситон','Турманситон','Бошқа давлатлар'],
    'Юборилган хабарлар бўйича':['Марказларга  юборилган  хабарлар сони','Вояга етмаганлар ишлари бўйича идоралараро комиссияга ','Марказларга юборилган хабарлар бўйича жавоб олинган'],
    'Олиб келинганлар кимларга топширилган':['Бошқа марказга юборилган','Ота-онаси ёки яқин қариндошлари','РЎТМ (ўғил)','РЎТМ (қиз)','ИТМ','Меҳри-бонлик уйлари','"SOS" болалар шаҳарчаси','Оилавий болалар уйи','Потранат','Фарзандлик','Васий ва ҳомий','ССМга юборилган','Бошқа давлатларга олиб борилганлар'],

    'Ихтисослаштирилган таълим муассасасини тугатгандан сўнг бандлиги таъминланганлар':['Олий таълим муассасасига кирганлар','Касб-ҳунарга ўқитилганлар','Муддатли ҳарбий хизматга юборилганлдар ','Меҳнат органлари томонидан ишга жойлаштирилганлар']
}

headers_2 = [
    'Марказлар сони', 'Жами марказга жойлаштирилган' , 'Шундан', 'Кимлар томонидан олиб келинган','Таълим тури','Ёши','Жинси','Сақланган муддатлари',

    'Жами олиб келинганлар','Олиб келинганлар кимга топширилган ','Ҳозирда Марказларда сақланётган болалар сони','Жинси',

    'Жами масъулларга топширилган  вояга етмаганлар сони','Хар ойда, Мониторинг қилинганлари сони ','Фоизи',
    'МЖтКнинг 47-моддасига асосан кўрилган чоралар сони','Психологлар томонидан ота-оналарга ўтказилган тренинглар сони',
    'Мониторинг жараёнида ота-онасидан марказга қайтарилганлар','Марказ томонидан ИТМга жойлаштирилганлар ', 'ИТМдан қочганлар', 'ИТМни тугатганлар',
    'Ихтисослаштирилган таълим муассасасини тугатгандан сўнг бандлиги таъминланганлар', 'Бандлиги таъминланмаган',


]

subheaders_2 = {
    'Шундан':['Бошқа давлатдан олиб келинган','Бошқа давлат боласи'],
    'Кимлар томонидан олиб келинган':['Инспектор','Психолог','Марказ ходими','Бошқалар'],
    'Таълим тури':['Мактабгача таълим','Мактаб','Касб-хунар мактаб ','Касб-хунар колеж ','Лицей','Техникум','Махсус таълим','ОТМ','Ўқимайди-ишламайди','Ишлайди'],
    'Ёши':['3-6.','7-13.','14-18.'],
    'Жинси':['Ўғил бола','Қиз бола'],
    'Сақланган муддатлари':['2 кунгача','10 кунгача','20 кунгача','30 кунгача','45 кунгача',],

    'Олиб келинганлар кимга топширилган ':['Бошқа марказга юборилган','Ота-онаси ёки яқин қариндошлари','РЎТМ (ўғил)','РЎТМ (қиз)','ИТМ','Меҳри-бонлик уйлари','"SOS" болалар шаҳарчаси','Оилавий болалар уйи','Потранат','Фарзандлик','Васий ва ҳомий','ССМга юборилган','Бошқа давлатга юборилган'],
}
